#language: ru
Функционал: Интернет-магазин

Сценарий: Сценарий 1

    * Выполните поиск по «iphone»
    * Ограничить цену до 60 000
    * Отметить чекбокс – Высокий рейтинг
    * Отметить чекбокс – 3Гб
    * Из результатов поиска добавьте в корзину первые 5 нечетных товаров.
    * Перейдите в корзину, убедитесь, что все добавленные ранее товары находятся в корзине
    * Проверить, что отображается текст «Ваша корзина - 5 товаров»
    * Удалите все товары из корзины
    * Проверьте, что корзина не содержит никаких товаров
    * Добавить отчет с максимальной ценой