#language: ru
Функционал: Интернет-магазин

Сценарий: Сценарий 2

    * Выполните поиск по «беспроводные наушники»
    * Ограничить цену до 10 000
    * Бренды : Beats, Samsung
    * Отметить чекбокс – Высокий рейтинг
    * Из результатов поиска добавьте в корзину первые 3 четных товаров.
    * Перейдите в корзину, убедитесь, что все добавленные ранее товары находятся в корзине
    * Проверить, что отображается текст «Ваша корзина - 3 товара»
    * Удалите все товары из корзины
    * Проверьте, что корзина не содержит никаких товаров
    * Добавить отчет с максимальной ценой